作为起始指南，一开始先以Gremlin控制台作为引子来对Gremlin展开了解（写这篇指南时最新的版本号为3.4.1）。

# 从控制台开始
先下载[控制台](https://www.apache.org/dyn/closer.lua/tinkerpop/3.4.1/apache-tinkerpop-gremlin-console-3.4.1-bin.zip)然后解压并运行，得到如下界面：

```
$ unzip apache-tinkerpop-gremlin-console-3.4.1-bin.zip
$ cd apache-tinkerpop-gremlin-console-3.4.1
$ bin/gremlin.sh

         \,,,/
         (o o)
-----oOOo-(3)-oOOo-----
plugin activated: tinkerpop.server
plugin activated: tinkerpop.utilities
plugin activated: tinkerpop.tinkergraph
gremlin>
```

Gremlin 控制台使用的是 "Gremlin Traversal Language"，这个语言兼容 Groovy 语言。

要使用 Gremlin 遍历一个图需要先获得一个 **TraversalSource** 实例，这个实例中包含了一个图实例的引用，而图实例中才是真正保存图数据的实例对象。TinkerPop作为不同图数据库的一个抽象层，所以在控制台中可以通过创建[不同的实例](http://tinkerpop.apache.org/#graph-systems)去连接不同的图数据库。用 [TinkerGraph](http://tinkerpop.apache.org/docs/3.4.1/reference/#tinkergraph-gremlin) 实例来入门是最好的，TinkerGraph 是一个快速的内存型图数据库，它的配置很少，所以很容易上手。

按照官方文档的例子，选择 "Modern" 图作为第一张入门图，它的结构如下：

![Modern图](http://tinkerpop.apache.org/docs/3.4.1/images/tinkerpop-modern.png)

在控制台中可以通过如下指令创建它：
```
gremlin> graph = TinkerFactory.createModern()
==>tinkergraph[vertices:6 edges:6]
gremlin> g = graph.traversal()
==>graphtraversalsource[tinkergraph[vertices:6 edges:6], standard]
```

这里的第一个指令创建了一个图实例，但只有图实例是不能完成遍历操作，需要通过这个图实例创建一个 **TraversalSource** 实例来提供遍历操作（如第二条指令所示），TraversalSource 实例中封装了对图遍历操作的方法。

现在有了名为 **g** 的 **TraversalSource** 实例，我们可以开始遍历这张图了：

```
gremlin> g.V()
==>v[1]
==>v[2]
==>v[3]
==>v[4]
==>v[5]
==>v[6]
gremlin> g.V(1)
==>v[1]
gremlin> g.V(1).values('name')
==>marko
gremlin> g.V(1).outE('knows')
==>e[7][1-knows->2]
==>e[8][1-knows->4]
gremlin> g.V(1).outE('knows').inV().values('name')
==>vadas
==>josh
gremlin> g.V(1).out('knows').values('name')
==>vadas
==>josh
gremlin> g.V(1).out('knows').has('age', gt(30)).values('name')
==>josh
```

对上面7条指令进行解释：
1. 获取图中的所有节点
2. 获取ID为 1 的节点。
3. 获取ID为 1 的节点的 **name** 属性信息。
4. 获取ID为 1 的节点上 label 为 "knows" 的边。
5. 获取ID为 1 的节点上 label 为 "knows" 的边指向的节点 "name" 属性。
6. 这个指令中的 **out()** 方法其实是上一条指令中 **outE().inV()** 的简写。
7. 与第6条指令相比增加了条件筛选，筛选 knows 出边连接的节点中， **age** 属性要大于 30。

<font color="red">注意:</font> 上面通过如 "x = g.V()" 的代码实际上获取到一个 **Traversal** 实例，这个 **Traversal** 实例上是一个迭代器而不是请求的结果数据集，因为控制台会自动遍历迭代器以展示结果数据。如果你是在其它非控制台环境下调用 "x = g.V()"，你需要编写额外的代码去遍历这个 "x" 以获取结果数据。

# 理解点和边
图就是由一系列点和一系列点与点之间连接的边组成，这里的点指的是**实体**（如：人，地区等），边指的是点与点之间的**关系**。

在Gremlin中，图是“有向图”，即每条边都是有方向的。边上会带有一个 **label** 值用于指名这个关系类型，如下图所示：

![带有label的边](http://tinkerpop.apache.org/docs/3.4.1/images/modern-edge-1-to-3-2.png)

图中有一条边从ID为1的person节点指向ID为3的software节点，边的 **label** 为 "created"，这样的关系可以看出ID为3的软件是由ID为1的人所创造的。

实际上，点和边上都可以添加自定义属性。如下图：

![带有自定义属性的点和边](http://tinkerpop.apache.org/docs/3.4.1/images/modern-edge-1-to-3-3.png)

# 创建一张图
上面介绍完一张图的基本组成元素，下面开始尝试创建一张简单的图，这张图仅有两个点和一条边组成。

依然是用Gremlin控制台实现：
```
gremlin> graph = TinkerGraph.open()
==>tinkergraph[vertices:0 edges:0]
gremlin> g = graph.traversal()
==>graphtraversalsource[tinkergraph[vertices:0 edges:0], standard]
gremlin> v1 = g.addV("person").property(id, 1).property("name", "marko").property("age", 29).next()
==>v[1]
gremlin> v2 = g.addV("software").property(id, 3).property("name", "lop").property("lang", "java").next()
==>v[3]
gremlin> g.addE("created").from(v1).to(v2).property(id, 9).property("weight", 0.4)
==>e[9][1-created->3]
```

上面的指令中，对 id 属性进行赋值时有点特别，它的属性名不是一个字符串，而更像是个已经定义好的变量。其实 id 变量是枚举类型 **T** 的一个成员，控制台默认通过Java的 "static import" 把枚举类型 **T** 中的成员都引入进来了，所以使用 T.id 跟直接使用 id 是一样。

在JVM中，枚举类型 **T** 的全名是 **org.apache.tinkerpop.gremlin.structure.T**，另一个很常用而且在Gremlin控制台中也会自动静态载入的是 "org.apache.tinkerpop.gremlin.process.traversal.dsl.graph" 包下的类。

**addV()** 方法用于添加节点，可以通过传递参数指定创建节点的 label 值，往后调用 **property()** 方法可以为这个新建的节点设置属性，**addV()** 和 **property()** 方法都是返回一个迭代器，要想获取真正的节点实例则需要调用这个迭代器的 **next()** 方法得到。

创建边也有 **addE()** 方法，同样是通过参数指定新建边的 label 值，往后的 **from()** 和 **to()** 方法用于指定边的方向，之后跟着的 **property()** 方法可以设置边的属性。

# 基本查询操作
为了简单起见，接下来对图做遍历的操作都会基于下面这个图进行查询。

![例子图](http://tinkerpop.apache.org/docs/current/images/modern-edge-1-to-3-1-gremlin.png)

通过 **g.V()** 可以获取到图中的所有节点的迭代器，但往往我们希望对这些节点做筛选，**has()** 操作用于对节点的属性进行筛选，例子如下：

```
gremlin> g.V().has('name','marko')
==>v[1]
```

这个操作是在查询拥有属性 "name" 且属性值为 "marko" 的节点，第一个参数指定属性名，第二个参数指定属性值。

**has()** 方法还可以传递三个参数的形式调用，用于筛选节点的 label 值，例子如下：

```
gremlin> g.V().has('person','name','marko')
==>v[1]
```

这里第一个参数指定 label 值，第二个参数指定属性名，第三个参数指定属性值。

如果我们想要获取节点上的出边，可以通过 **outE()** 方法获得，**outE()** 方法中的参数可以对出边的 label 值做筛选。例子如下：

![获取节点出边](http://tinkerpop.apache.org/docs/current/images/modern-edge-1-to-3-2-gremlin.png)

```
gremlin> g.V().has('person','name','marko').outE('created')
==>e[9][1-created->3]
```

如果我们想获取节点出边连接的其它相邻节点，可以通过 **out()** 方法获得，同样 **out()** 方法中的参数也可以对相邻节点的 label 值做筛选。例子如下：

![获取节点出边相邻的节点](http://tinkerpop.apache.org/docs/current/images/modern-edge-1-to-3-4-gremlin.png)

```
gremlin> g.V().has('person','name','marko').out('created')
==>v[3]
```

甚至可以在上面例子的基础上，通过 **values()** 方法获取查询节点上的属性值，例子如下：

```
gremlin> g.V().has('person','name','marko').out('created').values('name')
==>lop
```

图数据库的基本查询操作就如上面所示，你可以通过结合这些步骤实现更复杂的查询需求。

# 查询操作进阶
上一章节对基本的查询操作进行了介绍，这一章节会对查询操作做更深入的介绍，使用的图是之前提到的 "Modern" 图。

![Modern图](http://tinkerpop.apache.org/docs/current/images/tinkerpop-modern.png)

按回前面提到的方法创建一个 Modern 图：

```
gremlin> graph = TinkerFactory.createModern()
==>tinkergraph[vertices:6 edges:6]
gremlin> g = graph.traversal()
==>graphtraversalsource[tinkergraph[vertices:6 edges:6], standard]
```

前面我们已经演示过如何使用 **has()** 方法查询 "name" 属性为 "marko" 的节点，这里要演示的是查询 "name" 属性为 "vadas" 或 "marko" 的节点的 "age" 属性值。使用 **within()** 方法返回的结果传到 **has()** 方法的最后一个参数来实现这个目的，例子如下：

```
gremlin> g.V().has('person','name',within('vadas','marko')).values('age')
==>29
==>27
```

从例子中可以看出 **within()** 方法也是静态载入到 Gremlin 控制台的。

如果我们想要的是 "vadas" 和 "marko" 节点 "age" 属性的均值，可以使用 **mean()** 方法实现，例子如下：

```
gremlin> g.V().has('person','name',within('vadas','marko')).values('age').mean()
==>28.0
```

接下来，我们实现一个更复杂的查询需求：“谁与marko一起创建(created)了software?”。这个需求我们需要从 marko 节点遍历到他 created 的 software 节点，然后再反向查询有哪些人一起 created 了这些 software 节点，例子如下：

```
gremlin> g.V().has('person','name','marko').
           out('created').in('created').
           values('name')
==>marko
==>josh
==>peter
```

上面的例子中，先通过 "g.V().has('person','name','marko')" 找到 marko 节点，然后通过 ".out('created')" 找到了 marko 创建的 software 节点，然后再通过 ".in('created')" 反向查询到一起创建这个 software 的人，最后通过 ".values('name')" 获取他们的名称。

这个结果似乎不是完全符合我们的需求，我们要找的是与 marko 一起开发软件的人，所以结果应该排除 marko 节点。下面给出排除 marko 节点的例子：

```
gremlin> g.V().has('person','name','marko').as('exclude').
           out('created').in('created').
           where(neq('exclude')).
           values('name')
==>josh
==>peter
```

第一步，调用 "g.V().has('person','name','marko')" 返回的迭代器实例的 **as()** 方法构建了一个查询模板取名为 "exclude"，这个查询模板的内容是：查询 "name" 属性值为 "marko" 的 person 节点。模板的作用是缓存一个或多个查询条件组合，留作后面重复调用。

第二步，调用 **where()** 方法对查询到的节点做多一层过滤条件，**where()** 方法中的参数使用了 **neq()** 方法指明筛选不符合过滤条件的节点。例子中使用 ".where(neq('exclude'))" 排除 marko 节点，**neq()** 方法中的参数 "exclude" 就是上一步使用 **as()** 方法定义的名为 "exclude" 的查询模板。

**as()** 方法还有很多用法，这里给出配合 **select()** 方法查询 "Modern" 通过两条边间接连接的节点关系：

```
gremlin> g.V().out().out()
==>v[5]
==>v[3]
gremlin> g.V().as('a').out().as('b').out().as('c').
           select('a','b','c')
==>[a:v[1],b:v[4],c:v[5]]
==>[a:v[1],b:v[4],c:v[3]]
```

上面例子中调用了两次 **out()** 方法，意思是查询通过了两次边跳转才能到达的节点。从图中可以看出满足这个要求的路径只有2个，分别是 1->4->5 与 1->4->3。所以第一条命令返回的是节点3和5，而第二条命令则是想要得到整条路径上每个节点的信息，相对第一条命令多了一些 **as()** 方法的调用，并且最后使用 **select()** 方法把前面通过 **as()** 方法定义的查询模板对应的节点都展示出。"a,b,c" 模板查询结果分别对应路径上的第1,2,3个节点。

还有一种比较常用的查询是分组查询，通过 **group()** 方法与 **by()** 方法配套使用来实现，例子如下：

```
gremlin> g.V().group().by(label)
==>[software:[v[3],v[5]],person:[v[1],v[2],v[4],v[6]]]
```

上面的例子是查询所有节点，并且对节点的 label 做了分组。方法返回的结果是一个 Map，Map 中的 Key 对应分组的 label 值，Map 中的 Value 是分组下的节点实例。

我们可能只想要分组后的节点名称，可以对上面的命令的结果再使用一次 **by()** 方法来获取节点的 "name" 属性值，例子如下：

```
gremlin> g.V().group().by(label).by('name')
==>[software:[lop,ripple],person:[marko,vadas,josh,peter]]
```

相对于前一个例子，返回的结果依然是一个 Map，Map 中的 Key 对应分组的 label 值，Map 中的 Value 则是分组下节点的 "name" 属性值。

# TinkerTop 架构介绍
到目前为止已经对如何使用 Gremlin 有了初步的认识，接下来将对 Gremlin 的架构做细分介绍，之后你可以根据需求对特定的模块做深入研究。

TinkerTop 架构图如下：

![TinkerTop架构图](http://tinkerpop.apache.org/docs/current/images/provider-integration.png)

TinkerPop是不同图数据库和不同图处理器的抽象层，可以用同样的一份代码完成不同图数据库的实现。开发者只需要用 "Gremlin Traversal Language" 编写程序，同一份代码可以完成不同图数据库的实现，而且你依然可以开发特定图数据库的专有功能。